In [3]:
import pandas as pd
a = pd.DataFrame(data={'computers':[1,5,4,7,5],'mouse':[2,1,54,34,2],'monitors':[2,33,5,4,1]},index=['mumbai','delhi','kolkata','chennai','indore'])
print(a)

         computers  mouse  monitors
mumbai           1      2         2
delhi            5      1        33
kolkata          4     54         5
chennai          7     34         4
indore           5      2         1

In [4]:
a.to_csv('lab.csv')

Code 2

In [5]:
f = open('lab.txt')
l = f.readlines()
l

['White, red,blue,green,animal\n',
 '12-Feb-2015: Counting of animals inside the house\n',
 '1, 5, 2, 3, cat\n',
 '2, 7, 8, 5,dog\n',
 '13-Feb-2015: Counting of animals outside the house\n',
 '3, 3,6,7,horse\n',
 '2, 2,8,3,duck\n',
 '4, 4, 2,1,mouse']

In [6]:
%pip install html5lib

Requirement already satisfied: html5lib in c:\users\hp\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\hp\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\hp\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [11]:
a = pd.DataFrame(data={'computers':[1,5,4,7,5],'mouse':[2,1,54,34,2],'monitors':[2,33,5,4,1]},index=['mumbai','delhi','kolkata','chennai','indore'])
b = a.to_html('lab.html')

In [12]:
c = a.to_xml('lab.xml')

In [15]:
import codecs as cs
d = cs.open('lab.html','r')
print(d.read())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>computers</th>
      <th>mouse</th>
      <th>monitors</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>mumbai</th>
      <td>1</td>
      <td>2</td>
      <td>2</td>
    </tr>
    <tr>
      <th>delhi</th>
      <td>5</td>
      <td>1</td>
      <td>33</td>
    </tr>
    <tr>
      <th>kolkata</th>
      <td>4</td>
      <td>54</td>
      <td>5</td>
    </tr>
    <tr>
      <th>chennai</th>
      <td>7</td>
      <td>34</td>
      <td>4</td>
    </tr>
    <tr>
      <th>indore</th>
      <td>5</td>
      <td>2</td>
      <td>1</td>
    </tr>
  </tbody>
</table>

In [16]:
g = cs.open('lab.xml','r')
print(g.read())

<?xml version='1.0' encoding='utf-8'?>
<data>
  <row>
    <index>mumbai</index>
    <computers>1</computers>
    <mouse>2</mouse>
    <monitors>2</monitors>
  </row>
  <row>
    <index>delhi</index>
    <computers>5</computers>
    <mouse>1</mouse>
    <monitors>33</monitors>
  </row>
  <row>
    <index>kolkata</index>
    <computers>4</computers>
    <mouse>54</mouse>
    <monitors>5</monitors>
  </row>
  <row>
    <index>chennai</index>
    <computers>7</computers>
    <mouse>34</mouse>
    <monitors>4</monitors>
  </row>
  <row>
    <index>indore</index>
    <computers>5</computers>
    <mouse>2</mouse>
    <monitors>1</monitors>
  </row>
</data>

In [60]:
h = pd.read_excel('lab.xlsx',sheet_name='Sheet1')
h

  Unnamed: 0  Computer  mouse  keyboard
0      delhi        34      7         1
1     indore         2      7         2
2    chennai         8      7        32

In [61]:
h  = pd.read_excel('lab.xlsx',sheet_name='sheet2')
h

   Unnamed: 0  toys  games  cars
0           0     1      3     4
1           1    34      5     6
2           2    32     43    54
3           3     6      7     3
4           4    21     54     2

In [57]:
a = pd.DataFrame(data={'computers':[1,5,4,7,5],'mouse':[2,1,54,34,2],'monitors':[2,33,5,4,1]},index=['mumbai','delhi','kolkata','chennai','indore'])
a.to_excel('lab2.xlsx')
a

         computers  mouse  monitors
mumbai           1      2         2
delhi            5      1        33
kolkata          4     54         5
chennai          7     34         4
indore           5      2         1

In [58]:
a = pd.DataFrame(data={'computers':[1,5,4,7,5],'mouse':[2,1,54,34,2],'monitors':[2,33,5,4,1]},index=['mumbai','delhi','kolkata','chennai','indore'])
a.to_json('lab.json')
a

         computers  mouse  monitors
mumbai           1      2         2
delhi            5      1        33
kolkata          4     54         5
chennai          7     34         4
indore           5      2         1

In [59]:
q= pd.read_json('lab.json')
print(q)

         computers  mouse  monitors
mumbai           1      2         2
delhi            5      1        33
kolkata          4     54         5
chennai          7     34         4
indore           5      2         1